ycsb_logs/load.log
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=0
[OVERALL], RunTime(ms), 2214
[OVERALL], Throughput(ops/sec), 677.5067750677507
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1538.0
[CLEANUP], MinLatency(us), 1538
[CLEANUP], MaxLatency(us), 1538
[CLEANUP], 95thPercentileLatency(us), 1538
[CLEANUP], 99thPercentileLatency(us), 1538
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 214.12533333333334
[INSERT], MinLatency(us), 54
[INSERT], MaxLatency(us), 3279
[INSERT], 95thPercentileLatency(us), 522
[INSERT], 99thPercentileLatency(us), 706
[INSERT], Return=OK, 1500
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=64
[OVERALL], RunTime(ms), 1513
[OVERALL], Throughput(ops/sec), 991.4077990746861
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 753.0
[CLEANUP], MinLatency(us), 753
[CLEANUP], MaxLatency(us), 753
[CLEANUP], 95thPercentileLatency(us), 753
[CLEANUP], 99thPercentileLatency(us), 753
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 221.748
[INSERT], MinLatency(us), 56
[INSERT], MaxLatency(us), 2967
[INSERT], 95thPercentileLatency(us), 478
[INSERT], 99thPercentileLatency(us), 645
[INSERT], Return=OK, 1500
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=128
[OVERALL], RunTime(ms), 1515
[OVERALL], Throughput(ops/sec), 990.0990099009902
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 523.0
[CLEANUP], MinLatency(us), 523
[CLEANUP], MaxLatency(us), 523
[CLEANUP], 95thPercentileLatency(us), 523
[CLEANUP], 99thPercentileLatency(us), 523
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 297.90133333333335
[INSERT], MinLatency(us), 51
[INSERT], MaxLatency(us), 4123
[INSERT], 95thPercentileLatency(us), 598
[INSERT], 99thPercentileLatency(us), 753
[INSERT], Return=OK, 1500
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=192
[OVERALL], RunTime(ms), 1510
[OVERALL], Throughput(ops/sec), 993.3774834437086
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 442.0
[CLEANUP], MinLatency(us), 442
[CLEANUP], MaxLatency(us), 442
[CLEANUP], 95thPercentileLatency(us), 442
[CLEANUP], 99thPercentileLatency(us), 442
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 179.972
[INSERT], MinLatency(us), 36
[INSERT], MaxLatency(us), 9303
[INSERT], 95thPercentileLatency(us), 475
[INSERT], 99thPercentileLatency(us), 646
[INSERT], Return=OK, 1500
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=256
[OVERALL], RunTime(ms), 1510
[OVERALL], Throughput(ops/sec), 993.3774834437086
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 391.0
[CLEANUP], MinLatency(us), 391
[CLEANUP], MaxLatency(us), 391
[CLEANUP], 95thPercentileLatency(us), 391
[CLEANUP], 99thPercentileLatency(us), 391
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 105.778
[INSERT], MinLatency(us), 36
[INSERT], MaxLatency(us), 2553
[INSERT], 95thPercentileLatency(us), 282
[INSERT], 99thPercentileLatency(us), 449
[INSERT], Return=OK, 1500
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=320
[OVERALL], RunTime(ms), 1508
[OVERALL], Throughput(ops/sec), 994.6949602122016
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 315.0
[CLEANUP], MinLatency(us), 315
[CLEANUP], MaxLatency(us), 315
[CLEANUP], 95thPercentileLatency(us), 315
[CLEANUP], 99thPercentileLatency(us), 315
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 112.484
[INSERT], MinLatency(us), 33
[INSERT], MaxLatency(us), 2207
[INSERT], 95thPercentileLatency(us), 259
[INSERT], 99thPercentileLatency(us), 359
[INSERT], Return=OK, 1500
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=384
[OVERALL], RunTime(ms), 1510
[OVERALL], Throughput(ops/sec), 993.3774834437086
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 317.0
[CLEANUP], MinLatency(us), 317
[CLEANUP], MaxLatency(us), 317
[CLEANUP], 95thPercentileLatency(us), 317
[CLEANUP], 99thPercentileLatency(us), 317
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 106.562
[INSERT], MinLatency(us), 36
[INSERT], MaxLatency(us), 2527
[INSERT], 95thPercentileLatency(us), 272
[INSERT], 99thPercentileLatency(us), 427
[INSERT], Return=OK, 1500
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=448
[OVERALL], RunTime(ms), 1513
[OVERALL], Throughput(ops/sec), 991.4077990746861
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1688.0
[CLEANUP], MinLatency(us), 1688
[CLEANUP], MaxLatency(us), 1688
[CLEANUP], 95thPercentileLatency(us), 1688
[CLEANUP], 99thPercentileLatency(us), 1688
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 204.65933333333334
[INSERT], MinLatency(us), 37
[INSERT], MaxLatency(us), 2071
[INSERT], 95thPercentileLatency(us), 490
[INSERT], 99thPercentileLatency(us), 651
[INSERT], Return=OK, 1500
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=512
[OVERALL], RunTime(ms), 1512
[OVERALL], Throughput(ops/sec), 992.063492063492
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 336.0
[CLEANUP], MinLatency(us), 336
[CLEANUP], MaxLatency(us), 336
[CLEANUP], 95thPercentileLatency(us), 336
[CLEANUP], 99thPercentileLatency(us), 336
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 137.51066666666668
[INSERT], MinLatency(us), 33
[INSERT], MaxLatency(us), 2821
[INSERT], 95thPercentileLatency(us), 337
[INSERT], 99thPercentileLatency(us), 452
[INSERT], Return=OK, 1500